Revit 2027 API
IIFCImporterServer.ImportIFC Method
 The method that Revit will invoke to perform an import from IFC.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void ImportIFC(
	ImporterIFC importer
)
Sub ImportIFC (
	importer As ImporterIFC
)
void ImportIFC(
	ImporterIFC^ importer
)
abstract ImportIFC :
        importer : ImporterIFC -> unit
Parameters
importer ImporterIFC
 The IFC importer.
See Also
Reference
IIFCImporterServer Interface
Autodesk.Revit.DB.IFC Namespace